In [34]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [35]:
%matplotlib inline

In [36]:
gdp_df = pd.read_csv("../data/gdp_percapita.csv")

In [37]:
gdp_df.head()

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN

In [38]:
internet_df = pd.read_csv('../data/internet_use.csv',nrows=4496)

In [39]:
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

7. Look at the shape of each DataFrame - how many rows? How many columns?

In [40]:
gdp_df.shape

(6870, 4)

In [41]:
internet_df.shape

(4496, 4)

8. Take a look at the datatypes for the columns in each DataFrame.

In [42]:
gdp_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

In [43]:
internet_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

9. Take a look at the last 10 rows of each DataFrame in turn.

In [44]:
gdp_df.tail(10)

,Country or Area,Year,Value,Value Footnotes
6860,Zimbabwe,1997,3580.048793,NaN
6861,Zimbabwe,1996,3520.430146,NaN
6862,Zimbabwe,1995,3226.413930,NaN
6863,Zimbabwe,1994,3263.934978,NaN
6864,Zimbabwe,1993,3033.504852,NaN
6865,Zimbabwe,1992,3054.889178,NaN
6866,Zimbabwe,1991,3426.598094,NaN
6867,Zimbabwe,1990,3324.348171,NaN
6868,footnoteSeqID,Footnote,NaN,NaN
6869,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [45]:
internet_df.tail(10)

     Country or Area      Year     Value  Value Footnotes
4486        Zimbabwe      2001  0.799846              NaN
4487        Zimbabwe      2000  0.401434              NaN
4488        Zimbabwe      1999  0.161676              NaN
4489        Zimbabwe      1998  0.081648              NaN
4490        Zimbabwe      1997  0.033080              NaN
4491        Zimbabwe      1996  0.016790              NaN
4492        Zimbabwe      1995  0.007684              NaN
4493        Zimbabwe      1994  0.001739              NaN
4494        Zimbabwe      1990  0.000000              NaN
4495   footnoteSeqID  Footnote       NaN              NaN

10. Drop the value footnotes column from both DataFrames. Check that this worked as expected.

In [46]:
gdp_df.drop('Value Footnotes',axis=1)

     Country or Area                                      Year        Value
0        Afghanistan                                      2019  2065.036398
1        Afghanistan                                      2018  2033.779002
2        Afghanistan                                      2017  2058.383832
3        Afghanistan                                      2016  2057.062164
4        Afghanistan                                      2015  2068.265904
...              ...                                       ...          ...
6865        Zimbabwe                                      1992  3054.889178
6866        Zimbabwe                                      1991  3426.598094
6867        Zimbabwe                                      1990  3324.348171
6868   footnoteSeqID                                  Footnote          NaN
6869               2  Excludes South Sudan after July 9, 2011.          NaN

[6870 rows x 3 columns]

In [47]:
internet_df.drop('Value Footnotes',axis=1)

     Country or Area      Year     Value
0        Afghanistan      2014  6.390000
1        Afghanistan      2013  5.900000
2        Afghanistan      2012  5.454545
3        Afghanistan      2011  5.000000
4        Afghanistan      2010  4.000000
...              ...       ...       ...
4491        Zimbabwe      1996  0.016790
4492        Zimbabwe      1995  0.007684
4493        Zimbabwe      1994  0.001739
4494        Zimbabwe      1990  0.000000
4495   footnoteSeqID  Footnote       NaN

[4496 rows x 3 columns]

11. Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [48]:
gdp_df.rename(columns={"Country or Area":"Country", "Year":"Year", "Value":"GDP_Per_Capita"})

,Country,Year,GDP_Per_Capita,Value Footnotes
0,Afghanistan,2019,2065.036398,NaN
1,Afghanistan,2018,2033.779002,NaN
2,Afghanistan,2017,2058.383832,NaN
3,Afghanistan,2016,2057.062164,NaN
4,Afghanistan,2015,2068.265904,NaN
...,...,...,...,...
6865,Zimbabwe,1992,3054.889178,NaN
6866,Zimbabwe,1991,3426.598094,NaN
6867,Zimbabwe,1990,3324.348171,NaN
6868,footnoteSeqID,Footnote,NaN,NaN
6869,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

12. Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [49]:
internet_df.rename(columns={"Country or Area":"Country", "Year":"Year", "Value":"Internet_Users_Pct"})

            Country      Year  Internet_Users_Pct  Value Footnotes
0       Afghanistan      2014            6.390000              NaN
1       Afghanistan      2013            5.900000              NaN
2       Afghanistan      2012            5.454545              NaN
3       Afghanistan      2011            5.000000              NaN
4       Afghanistan      2010            4.000000              NaN
...             ...       ...                 ...              ...
4491       Zimbabwe      1996            0.016790              NaN
4492       Zimbabwe      1995            0.007684              NaN
4493       Zimbabwe      1994            0.001739              NaN
4494       Zimbabwe      1990            0.000000              NaN
4495  footnoteSeqID  Footnote                 NaN              NaN

[4496 rows x 4 columns]

13.  Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

In [64]:
gdp_and_internet_use = pd.concat([gdp_df, internet_df], axis=1, join='inner')

14. Look at the first five rows of your new DataFrame to confirm it merged correctly.

In [65]:
gdp_and_internet_use.head(5)

,Country or Area,Year,Value,Value Footnotes,Country or Area,Year,Value,Value Footnotes
0,Afghanistan,2019,2065.036398,NaN,Afghanistan,2014,6.390000,NaN
1,Afghanistan,2018,2033.779002,NaN,Afghanistan,2013,5.900000,NaN
2,Afghanistan,2017,2058.383832,NaN,Afghanistan,2012,5.454545,NaN
3,Afghanistan,2016,2057.062164,NaN,Afghanistan,2011,5.000000,NaN
4,Afghanistan,2015,2068.265904,NaN,Afghanistan,2010,4.000000,NaN

15. Look at the last five rows to make sure the data is clean and as expected.

In [66]:
gdp_and_internet_use.tail(5)

,Country or Area,Year,Value,Value Footnotes,Country or Area,Year,Value,Value Footnotes
4491,New Zealand,1991,26512.645214,NaN,Zimbabwe,1996,0.016790,NaN
4492,New Zealand,1990,28135.652142,NaN,Zimbabwe,1995,0.007684,NaN
4493,Nicaragua,2019,5407.120700,NaN,Zimbabwe,1994,0.001739,NaN
4494,Nicaragua,2018,5694.924480,NaN,Zimbabwe,1990,0.000000,NaN
4495,Nicaragua,2017,6004.017296,NaN,footnoteSeqID,Footnote,NaN,NaN

16. Subset the combined DataFrame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.